Магазин_ГаджетОнОфф/src/Catalogs/Пользователи/Пользователи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Пользователи</name>
  <attributes>
    <name>ПолноеИмя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>400</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>СписокРолей</name>
    <attributes>
      <name>ИмяРоли</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПредставлениеРоли</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Активен</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Магазин_ГаджетОнОфф/src/Catalogs/Пользователи/ObjectModule.bsl
Процедура ЗаполнитьТаблицуРолей() Экспорт
	
	ТекПользователь = ПользователиИнформационнойБазы.НайтиПоИмени(Наименование);
	
	СписокРолей.Очистить();
	
	Роли = Метаданные.Роли;
	
	Для Каждого Роль Из Роли Цикл
		
		НовСтрока = СписокРолей.Добавить();
		НовСтрока.ИмяРоли = Роль.Имя;
		НовСтрока.ПредставлениеРоли = Роль.Синоним;
		НовСтрока.Активен = ТекПользователь.Роли.Содержит(Роль);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	ТекПользователь = ПользователиИнформационнойБазы.НайтиПоИмени(Наименование);
	
	Если ТекПользователь = Неопределено Тогда
		ТекПользователь = ПользователиИнформационнойБазы.СоздатьПользователя();
		ТекПользователь.Имя = Наименование;
		ТекПользователь.ПолноеИмя = ПолноеИмя;				
	КонецЕсли;
	
	МассивРолей = СписокРолей.НайтиСтроки(Новый Структура("Активен", Истина));
	Для Каждого СтрокаРоли Из МассивРолей Цикл
		ТекПользователь.Роли.Добавить(Метаданные.Роли.Найти(СтрокаРоли.ИмяРоли));
	КонецЦикла;
	ТекПользователь.Записать();
	
КонецПроцедуры
